<script setup lang="ts">
import router from '@/router';
// @ts-ignore
import { reactive, computed, ref } from 'vue';



const check = ref (false)
const next=()=>{
if(check.value === true){
router.push('/firstpage')
}
else{
    alert('قوانین را فبول نکردید!')
}
}

</script>

<template>
    <br>
    <main style="padding-bottom: ;">
        <br>
        <br>
        <br>

        <div class="container"
            style=" font-family: B Homa; text-align: right; background-color: rgba(255, 255, 255, 0.76); padding: 30px; border-radius: 20px; backdrop-filter: blur(10px);"
            dir="rtl">
          
<h2 style="text-align: center;">مقررات انظباطی هنرستان فنی و حرفه ای شبانه روزی نمونه دولتی امام خمینی (ره)</h2>       
<hr>
<br>
<li>متعهد می شوم شعائر دینی را رعایت و با سایر هنرجویان و کارکنان هنرستان با ادب و احترام رفتار نمایم.</li>
<li>متعهد می شوم در ساعات رسمی آموزش(7 صبح الی 14) بدون اطلاع و کسب اجازه از مدیر و یا معاون آموزشی تحت هیچ شرایطی (حتی برای زمان کوتاه) از هنرستان خارج نشوم.</li>
<li>متعهد می شوم مطابق با برنامه اعلام شده راس ساعت در هنرستان حاضر و در مراسم آغازین حضور فعال داشته باشم.</li> 
<li>متعهد می شوم از آوردن هرگونه وسایل قیمتی( طلا و جواهر آلات، پول و... ) بدون هماهنگی دفتر آموزشی پرهیز نمایم.</li> 
<li>متعهد می شوم در صورت غیبت(موجه یا غیر موجه) در اسرع وقت موضوع را حضوری و یا از طریق تماس تلفنی به دفتر آموزشی هنرستان اطلاع دهم.</li>
<li>متعهد می شوم در صورت مشاهده هر گونه رفتار ناشایست از سوی دیگران( توهین، ضرب و شتم و...) بلافاصله مدیر و یا معاون آموزشی را مطلع سازم.</li>
<li>متعهد می شوم از آوردن هرگونه وسیله دیجیتالی حتی خاموش مانند(موبایل، تبلت، لپ تاپ، ساعت هوشمند، هندزفری، دستگاه ضبط صوت و...) بدون هماهنگی دفتر آموزشی اجتناب نمایم.</li>
<li>متعهد می شوم در حفظ و نگهداری هنرستان و تجهیزات آن کوشا باشم و در صورت مشاهده تخریب و آسیب به بیت المال توسط دیگران کادر هنرستان را  مطلع سازم.</li>
<li>متعهد میشوم جهت شرکت در نماز جماعت، مراسم مذهبی و همچنین شرکت در جشنواره ها و مسابقات پیش قدم باشم.</li>
<li>متعهد می شوم ضمن رعایت بهداشت فردی و محیط، در پایان ساعت کارگاه، محیط را نظافت و اصول کار  با تجهیزات ودستگاه ها(مانند اطمینان از خاموش بودن، روغن کاری و...) را رعایت نمایم.</li>
<li>متهد می شوم با ظاهری آراسته، لباس و پوششی مناسب در هنرستان حاضر شوم.</li>
<li>متعهد می شوم از اسراف مواد مصرفی پرهیز کنم و ضمن رعایت اصول امانت داری، ابزارها و مواد مصرفی مازاد را در پایان ساعت آموزشی به انبار تحویل دهم.</li>
<li>می دانم هرگونه خرید، فروش و تبلیغات خصوصاً تبلیغ کاندیداها در بازه زمانی انتخابات در هنرستان ممنوع است.</li>
<li>متعهد می شوم همه روزه حتی در روزهای تعطیل در فضای مجازی سامانه شاد فعال باشم، تکالیف، اخبار و برنامه های هنرستان را از این طریق پیگیری نمایم.</li>
<li>متعهد میشوم در صورت هر گونه تغییر در مشخصات شناسنامه ای،  شماره تلفن های خودم، پدر و مادرم و همچنین آدرس محل سکونت بلافاصله مدیر و یا معاون اجرایی هنرستان را مطلع سازم.</li>
<li>اولیا محترم می بایست در جلسات انجمن اولیا حضور فعال داشته باشند، همچنین برنامه ها و اخبار هنرستان را همه روزه از طریق وب سایت و کانال هنرستان در شاد پیگیری نمایند.</li>
<li> می دانم که هنرستان هیچگونه تعهدی در قبال تامین سرویس ایاب و ذهاب هنرجویان روزانه و خوابگاهی ندارد.</li>
<li>می دانم که هنرجویان خوابگاهی موظف هستند زیر نظر سرپرست قوانین خوابگاه را محترم بشمارند، همچنین مسئولیت حفظ و نگهداری وسایل شخصی و همچنین بیت المال بر عهده شخص هنرجو است.</li>
<li>متعهد می شوم اصول ایمنی در کارگاه را رعایت کنم، بدون اجازه مربی و سرپرست بخش با دستگاه ها کار نکنم.</li>
<li>متعهد می شوم مسئولیت هرگونه آسیب دیدگی خودم و یا آسیب رساندن به دیگران بدلیل عدم رعایت اصول ایمنی، شوخی، نزاع و درگیری خصوصا در محیط پر خطر مانند کارگاه برعهده خودم است.</li>
<li>متعهد می شوم در حفظ و نگهداری تجهیزات و ابزارهایی که تحویل بنده شده مانند(رایانه، صندلی، دریل، فرز و...)کوشا باشم و خسارت وارد شده حتی توسط دیگران را جبران نمایم.</li>



<br>
<br>
<div style="display: flex;">
    <input v-model="check" type="checkbox" style="width:40px ; ">

    <label style="font-size: 20px;" for="">قوانین و مقررات را میپزیرم</label>

</div>
<br>
<br>
<button type="submit" class="btn btn-primary" @click="next()">بعدی</button>

    </div>

</main>
</template>
<style>
li{
  font-size: 15px;
}
  input[type="checkbox"] {
      appearance: none;
      -webkit-appearance: none;
      -moz-appearance: none;
      width: 25px;
      height: 25px;
      border: 2px solid #ccc;
      border-radius: 5px;
      outline: none;
      cursor: pointer;
    }

    /* Style the custom checkbox appearance */
    input[type="checkbox"]::before {
      content: "";
      display: inline-block;
      width: 20px;
      height: 20px;
      background-color: #fff;
      border-radius: 3px;
      border: 2px solid #3b4899;
      transform: translateY(-2px) translateX(-2px);
      transition: background-color 0.3s, border-color 0.3s;
    }

    /* Style the custom checkbox appearance when checked */
    input[type="checkbox"]:checked::before {
      background-color: #2bc700;
      border-color: #333;
    }

    /* Optional label style */
    </style>
